import { Modal, Button } from 'antd'
import styled from 'styled-components'

const Wrapper = styled('div')`
  padding: 23px 41px;
  line-height: 1;
  font-size: 20px;
`

const Title = styled('div')`
  text-align: center;
  font-size: 20px;

`
const Content = styled('div')`
  margin-top: 19px;
  background: #E6E6E6;
  padding: 24px 14px;
  height: 200px;
  overflow-y: scroll;
`

const ButtonWrapper = styled('div')`
  margin-top: 16px;
`

const SpecialDayModal = ({
  isOpen = false,
  onClose = () => {},
  onSubmit = () => {}
}) => {
  const closeModal = () => {
    onClose()
  }

  const submit = () => {
    console.log('')
    onSubmit()
  }
  return (
    <Modal
      width={400}
      bodyStyle={{ padding: '0px' }}
      title={null}
      visible={isOpen}
      onCancel={() => closeModal()}
      footer={null}
    >
      <Wrapper>
        <Title>
          ข้อกำหนดและเงื่อนไขการให้บริการ และนโยบายคุ้มครองความเป็นส่วนตัว
        </Title>
        <Content>
          DPIM Academy ขอเรียนให้ท่านทราบถึงนโยบายคุ้มครองข้อมูลส่วนบุคคลของลูกค้าหรือผู้เยี่ยมชม ดังนี้
          นโยบายส่วนบุคคลฉบับนี้ครอบคลุมผลิตภัณฑ์และบริการที่เกี่ยวข้อง ได้แก่ เว็บไซต์ dpimacademy.dpim.go.th และ โซเชียลมีเดีย (Social Media) และช่องทางอื่น ๆ ในอนาคต
          ท่านรับทราบว่า เมื่อท่านใช้บริการของเรา ถือว่าท่านได้รับทราบและยินยอมปฏิบัติตามนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ และฉบับแก้ไขเพิ่มเติมในอนาคต
          หากท่านต้องการทราบรายละเอียดของนโยบายคุ้มครองข้อมูลส่วนบุคคลเพิ่มเติม โปรดกดอ่านตามหัวข้อที่ระบุไว้ข้างท้ายนี้
          ************ ให้เพิ่มไฮเปอร์ลิงก์หัวข้อด้านล่าง ไปที่ Corresponding topic ด้านล่าง ***********

          •	ข้อ 1: สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน
          •	ข้อ 2: การจัดเก็บข้อมูลส่วนบุคคลของท่าน
          •	ข้อ 3: จุดประสงค์การใช้ข้อมูลส่วนบุคคล และการเปิดเผยข้อมูล
          •	ข้อ 4: ข้อจำกัดในการใช้และ/หรือเปิดเผยข้อมูลส่วนบุคคล
          •	ข้อ 5: การเปลี่ยนแปลงข้อมูลส่วนบุคคลหรือการลบข้อมูลส่วนบุคคล
          •	ข้อ 6: คุกกี้ (Cookies) ไอพี แอดเดรส (IP Address)
          •	ข้อ 7: ความปลอดภัยของข้อมูลส่วนบุคคล
          •	ข้อ 8: ช่องทางการติดต่อเรา
          ข้อ 1: สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน
          1.	ท่านมีสิทธิที่จะเพิกถอนความยินยอมของท่านในเวลาใดก็ได้ สำหรับวัตถุประสงค์ที่ท่านได้ให้ความยินยอมให้เราเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
          2.	ท่านสามารถขอเข้าถึง ขอรับสำเนาข้อมูลส่วนบุคคลของท่าน หรือขอให้เปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคล ทั้งนี้ เราอาจปฏิเสธคำขอของท่านได้ตามที่กฎหมายกำหนด หรือตามคำสั่งศาล
          3.	ท่านมีสิทธิที่จะได้รับข้อมูลที่ได้ให้ไว้กับเราในรูปแบบอิเล็กทรอนิกส์ และมีสิทธิในการถ่ายโอนข้อมูลของท่านสำหรับการใช้งานในบริการของบุคคลอื่น และในการใช้สิทธิดังกล่าวนี้ ท่านมีสิทธิที่จะให้เราถ่ายโอนข้อมูลไปยังบุคคลอื่น ๆ โดยตรง หากสามารถกระทำได้โดยทางเทคนิค
          4.	ท่านมีสิทธิคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลเกี่ยวกับท่าน ในกรณีดังนี้
          4.1) กรณีที่เป็นการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์เกี่ยวกับการตลาดแบบตรง
          4.2) กรณีที่เป็นการเก็บรวบรวม ใช้ หรือ เปิดเผยข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์เกี่ยวกับการศึกษาวิจัยทางวิทยาศาสตร์ ประวัติศาสตร์ หรือสถิติ เว้นแต่กรณีจำเป็นเพื่อการดำเนินภารกิจเพื่อประโยชน์สาธารณะของเรา
          4.3) กรณีที่เป็นข้อมูลที่เก็บรวบรวมไว้ด้วยเหตุจำเป็น เพื่อการดำเนินภารกิจเพื่อประโยชน์สาธารณะของเรา หรือเหตุจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมายของเรา เว้นแต่เราแสดงให้เห็นถึงเหตุอันชอบด้วยกฎหมายที่สำคัญยิ่งกว่า หรือเป็นไปเพื่อก่อตั้งสิทธิเรียกร้องตามกฎหมาย การปฏิบัติตาม หรือการใช้สิทธิเรียกร้องตามกฎหมาย หรือการยกขึ้นต่อสู้สิทธิเรียกร้องตามกฎหมาย
          5. ท่านสามารถขอให้ลบหรือทำลาย หรือทำให้ข้อมูลส่วนบุคคลของท่านกลายเป็นข้อมูลที่ไม่ระบุตัวบุคคล เว้นแต่เป็นกรณีที่เราต้องปฏิบัติตามกฎหมายที่เกี่ยวข้องในการเก็บรักษาข้อมูลดังกล่าว
          6. ท่านสามารถขอให้เราระงับการประมวลผลข้อมูลส่วนบุคคลของท่านทั้งหมด หรือบางส่วน เป็นการชั่วคราวหรือถาวร
          7. ท่านสามารถขอแก้ไข หรือเปลี่ยนแปลงข้อมูลส่วนบุคคลของท่าน ในกรณีที่ข้อมูลส่วนบุคคลของท่านไม่ถูกต้องตามความเป็นจริง และทำให้ข้อมูลของท่านเป็นปัจจุบัน
          8. ท่านมีสิทธิร้องเรียนต่อหน่วยงานของรัฐที่เกี่ยวข้อง ในกรณีที่ท่านเชื่อว่าการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของเรานั้น ฝ่าฝืนหรือไม่ปฏิบัติตาม พ.ร.บ.คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
          ข้อ 2: การจัดเก็บข้อมูลส่วนบุคคลของท่าน
          เมื่อท่านลงทะเบียนเพื่อเป็นสมาชิกของเราหรือทำสัญญา/ธุรกรรมกับเรา ข้อมูลที่เราจัดเก็บอาจรวมถึงข้อมูลเหล่านี้
          •	ชื่อและนามสกุล
          •	เลขที่บัตรประจำตัวประชาชน
          •	วันเดือนปีเกิด
          •	เพศ
          •	ที่อยู่
          •	เบอร์โทรศัพท์
          •	อีเมล
          •	ประวัติการอบรม
          •	ประวัติการเข้าใช้งาน
          ในกรณีที่ท่านทำธุรกรรมกับเรา จะมีการจัดเก็บข้อมูลทางการเงินเพิ่มเติม เช่น
          •	เลขที่บัญชีธนาคาร
          รวมถึงข้อมูลส่วนตัวอื่น ๆ เท่าที่จําเป็น โดยข้อมูลจะต้องเป็นข้อมูลที่ถูกต้อง ครบถ้วน ข้อมูลเป็นปัจจุบัน และไม่ก่อให้เกิดการเข้าใจผิด การรวบรวมข้อมูลดังกล่าวจะทําให้เราสามารถทราบความต้องการของท่าน และให้บริการกับท่านได้ตามวัตถุประสงค์การให้บริการ
          นอกจากขั้นตอนการลงทะเบียนสมาชิกแล้ว เราอาจสอบถามข้อมูลส่วนบุคคลอื่นเพิ่มเติมจากท่าน เช่น เมื่อท่านเข้าร่วมกิจกรรม หรือบริการที่เราจัดขึ้น โดยท่านอาจต้องระบุข้อมูลเพิ่มเติม เช่น ความสนใจในคอร์สฝึกอบรมต่าง ๆ ฯลฯ การแจ้งข้อมูลส่วนบุคคลเพิ่มเติมจะทําให้ท่านสามารถรับบริการต่าง ๆ ได้มากขึ้น และไม่พลาดโอกาสพิเศษสําหรับสมาชิก
          ข้อ 3: จุดประสงค์การใช้ข้อมูลส่วนบุคคล และการเปิดเผยข้อมูล
          วัตถุประสงค์เบื้องต้นในการรวบรวมข้อมูลส่วนบุคคล คือ เพื่อให้ผู้ใช้บริการแต่ละรายของเราได้รับบริการด้านการอบรมออนไลน์ที่ดีจากเราอย่างมีประสิทธิภาพ 
          ทั้งนี้ ข้อมูลดังกล่าวของท่านจะถูกเก็บรวบรวมและรักษาไว้ เราอาจใช้ข้อมูลส่วนบุคคลของท่าน หรือส่งต่อแก่หน่วยงานภายในกรมอุตสาหกรรมพื้นฐานและการเหมืองแร่ เพื่อประโยชน์ของท่านและของกิจการบางส่วน ดังต่อไปนี้
          1.	เพื่อดำเนินการตามวัตถุประสงค์ตามกฎหมาย
          2.	เพื่อคุ้มครองสิทธิในทรัพย์สิน หรือความปลอดภัยของ DPIM Academy หรือของผู้ใช้บริการของเรา
          นโยบายส่วนบุคคลนี้ไม่ครอบคลุมการรวบรวม และการใช้ข้อมูลส่วนบุคคลของบุคคลภายนอก ที่กระทำโดยบุคคลภายนอก ไม่ว่าจะเป็นผู้โฆษณา ผู้ให้บริการ ผู้ขายสินค้าในเว็บไซต์อื่น ๆ ที่เชื่อมต่อ (Link) กับเว็บไซต์, แอปพลิเคชัน, โซเชียลมีเดีย (Social Media) หรือช่องทางในอนาคตของเรา การเชื่อมโยงระบบโซเชียลมีเดีย (Social Media) เพื่อแชร์เนื้อหาในช่องทางของเรา หากการกระทำใด ๆ ก็ตามที่ขัดต่อกฎหมาย และก่อให้เกิดความเสียหายแก่เรา ทางเราจะไม่รับผิดชอบในความเสียหายใด ๆ อันเนื่องมาจากการกระทำหรือการรวบข้อมูลโดยบุคคลภายนอก
          ข้อ 4: ข้อจำกัดในการใช้และ/หรือเปิดเผยข้อมูลส่วนบุคคล
          1.	เราจะใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่านได้ตามความยินยอมของท่าน โดยจะต้องเป็นการใช้ตามวัตถุประสงค์ของการเก็บรวบรวมข้อมูลของเราเท่านั้น เราจะกำกับดูแลพนักงานหรือผู้ปฏิบัติงานของเรามิให้ใช้และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่านนอกเหนือไปจากวัตถุประสงค์ของการเก็บรวบรวมข้อมูลส่วนบุคคล หรือเปิดเผยต่อบุคคลภายนอก เว้นแต่
          1.1) เป็นการปฏิบัติตามกฎหมาย เช่น พ.ร.บ.คุ้มครองข้อมูลส่วนบุคคล พ.ร.บ.ว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พ.ร.บ.ป้องกันและปราบปรามการฟอกเงิน ประมวลกฎหมายแพ่งและอาญา ประมวลกฎหมายวิธีพิจารณาความแพ่งและอาญา ฯลฯ
          1.2) เป็นไปเพื่อประโยชน์แก่การสอบสวนของพนักงานสอบสวน หรือการพิจารณาพิพากษาคดีของศาล
          1.3) เพื่อประโยชน์ของท่าน และการขอความยินยอมไม่อาจกระทำได้ในเวลานั้น
          1.4) เป็นการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมายของเรา หรือของบุคคลหรือนิติบุคคลอื่นที่ไม่ใช่เรา
          1.5) เป็นการจำเป็นเพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของบุคคล
          1.6) เป็นการจำเป็นเพื่อการปฏิบัติตามสัญญา ซึ่งเจ้าของข้อมูลส่วนบุคคลเป็นคู่สัญญาหรือเพื่อใช้ในการดำเนินการตามคำขอของเจ้าของข้อมูลส่วนบุคคลก่อนเข้าทำสัญญานั้น
          1.7) เพื่อให้บรรลุวัตถุประสงค์ที่เกี่ยวกับการจัดทำเอกสารประวัติศาสตร์หรือจดหมายเหตุ เพื่อประโยชน์สาธารณะ หรือเพื่อการศึกษา วิจัย การจัดทำสถิติ ซึ่งได้จัดให้มีมาตรการป้องกันที่เหมาะสม
          2.	เราอาจใช้บริการสารสนเทศของผู้ให้บริการ ซึ่งเป็นบุคคลภายนอก เพื่อให้ดำเนินการเก็บรักษาข้อมูลส่วนบุคคล ซึ่งผู้ให้บริการนั้นจะต้องมีมาตรการรักษาความมั่นคงปลอดภัย โดยห้ามดำเนินการเก็บรวบรวม ใช้หรือเปิดเผยข้อมูลส่วนบุคคลนอกเหนือจากที่เรากำหนด
          ข้อ 5: การเปลี่ยนแปลงข้อมูลส่วนบุคคลหรือการลบข้อมูลส่วนบุคคล
          ผู้ใช้บริการทุกรายที่ได้ลงทะเบียนกับเรา สามารถเข้าถึงข้อมูลส่วนบุคคลของตนเองได้ โดยท่านสามารถดําเนินการปรับปรุงแก้ไข หรือลบข้อมูลส่วนบุคคลของท่านได้ตลอดเวลา โดยการเชื่อมต่ออีเมล ในส่วนที่เกี่ยวเนื่องกับบัญชีผู้ใช้งานของท่าน ท่านอาจลบข้อมูลดังกล่าวด้วยตนเอง หรือแจ้งให้เราดำเนินการได้ แต่การกระทำดังกล่าวอาจทําให้ท่านเสียโอกาสในการเข้ารับบริการของเราได้
          ข้อ 6: คุกกี้ (Cookies) ไอพี แอดเดรส (IP Address)
          นอกจากข้อมูลส่วนบุคคล เราอาจเก็บรวบรวมข้อมูลบางอย่างผ่านเทคโนโลยี เช่น คุกกี้ (Cookies) ไอพี แอดเดรส (IP Address) และแหล่งเก็บข้อมูลบนเบราว์เซอร์และอุปกรณ์ของผู้ใช้ รวมถึงเครื่องมือเก็บข้อมูลของบุคคลภายนอก เช่น ผู้ให้บริการด้านการตลาดหรือวิเคราะห์ ในการเก็บรวบรวมข้อมูลโดยใช้เทคโนโลยีประเภทนี้โดยตรงบนเว็บไซต์
          ทั้งนี้ คุกกี้ (Cookies) คือ ไฟล์ข้อมูลตัวอักษรขนาดเล็กที่รวบรวมข้อมูลในคอมพิวเตอร์ โทรศัพท์เคลื่อนที่ หรืออุปกรณ์อื่นของผู้ใช้งาน 
          ด้วยการทำงานของคุกกี้ จะทําให้เราสามารถจดจําผู้ใช้บริการที่เคยเข้าชมเว็บไซต์ ทราบถึงจํานวนและวัตถุประสงค์ของผู้ที่ใช้บริการเว็บไซต์ และช่วยให้เราจัดบริการข้อมูล พัฒนาประสบการณ์การเข้าชมเว็บไซต์ ปรับปรุงคุณภาพการให้บริการ 
          วิธีปิดการทำงานของคุกกี้
          ท่านมีสิทธิตั้งค่าคุกกี้ โดยท่านอาจแก้ไขเบราว์เซอร์ของท่านให้ปฏิเสธการเก็บคุกกี้ หากท่านต้องการปฏิเสธการเก็บคุกกี้ทั้งหมด ท่านอาจไม่สามารถเชื่อมต่อกับเว็บไซต์ของเราอย่างมีประสิทธิภาพ
          ท่านสามารถศึกษารายละเอียดเพิ่มเติมเกี่ยวกับคุกกี้ได้จาก aboutcookies.org และศึกษาวิธีจัดการความเป็นส่วนตัวของท่านจากเว็บเบราว์เซอร์ที่ท่านใช้ ตามรายละเอียดดังนี้:
          •	Chrome
          •	Chrome for android
          •	Chrome for iOS
          •	Firefox
          •	Internet Explorer
          •	Safari
          •	Safari for iOS
          DPIM Academy ใช้คุกกี้ประเภทใดบ้าง
          เพื่อให้ท่านมีประสบการณ์การที่ดีในการใช้งานเว็บไซต์ dpimacademy.dpim.go.th ใช้คุกกี้ต่าง ๆ ดังนี้ โดยคุกกี้ดังกล่าวไม่สามารถระบุตัวตนของท่านได้
          •	คุกกี้ที่จำเป็นสำหรับการทำงานของเว็บไซต์ (strictly necessary cookies)
          คุกกี้ประเภทนี้มีความสำคัญต่อการทำงานของเว็บไซต์ dpimacademy.dpim.go.th ซึ่งจะช่วยให้ท่านสามารถเข้าถึงข้อมูลและเนื้อหาต่าง ๆ ของเว็บไซต์เราได้ทุกส่วน และปลอดภัย
          คุกกี้ประเภทนี้ จะถูกลบออกหลังจากการเข้าชมเว็บไซต์ของท่าน หากท่านปิดการทำงานของคุกกี้เหล่านี้ ท่านอาจจะไม่สามารถใช้บริการเว็บไซต์ของเราได้ตามต้องการ เช่น การอ่าน และการนำทางระหว่างหน้าเว็บ
          ข้อ 7: ความปลอดภัยของข้อมูลส่วนบุคคลของท่าน
          เราใช้ระบบรักษาความปลอดภัยแบบ SSL (Secure Socket Layer) หรือ Secure Electronic Transaction (SET) เพื่อคุ้มครองข้อมูลส่วนบุคคลและความเป็นส่วนตัวของท่าน โดยระบบดังกล่าวนี้ได้มาตรฐานสากล และออกแบบมาเพื่อคุ้มครองข้อมูลส่วนบุคคลโดยเฉพาะ
          จากระบบรักษาความปลอดภัยดังกล่าว มีเพียงท่านเท่านั้นที่สามารถเข้าถึงข้อมูลส่วนบุคคลนี้ได้ ท่านต้องระมัดระวังและรับผิดชอบดูแลข้อมูลส่วนบุคคลและรหัสผ่านของท่านด้วยตนเอง เราขอแนะนำว่าท่านไม่ควรเปิดเผยรหัสผ่านของท่านต่อบุคคลใด และท่านควรออกจากระบบ (Log Off) อินเทอร์เน็ตหรือการใช้คอมพิวเตอร์เบราว์เซอร์ของท่านทุกครั้งที่ท่านเลิกใช้คอมพิวเตอร์ เพื่อให้มั่นใจได้ว่าบุคคลอื่นไม่สามารถเข้าถึงข้อมูลส่วนบุคคล และการติดต่อของท่านได้ โดยเฉพาะอย่างยิ่งหากท่านใช้คอมพิวเตอร์ร่วมกับผู้อื่น หรือใช้คอมพิวเตอร์ในที่สาธารณะ
          เพื่อความปลอดภัยของข้อมูลส่วนบุคคลของท่าน และผู้ใช้บริการท่านอื่น ท่านตกลงว่าจะไม่กระทำการใดอันเป็นการล่วงละเมิดทางสิทธิส่วนบุคคล สิทธิส่วนบุคคลของบุคคลภายนอก และทรัพย์สินทางปัญญาของเรา รวมทั้งไม่กระทำการใด ๆ ที่ขัดต่อกฎหมาย โดยจะไม่ส่งเนื้อหา รูปภาพ ภาพเคลื่อนไหว หรือข้อมูลอื่นใดที่ไม่เหมาะสม ไม่สุภาพ ก่อให้เกิดความขัดแย้ง ข้อความที่เป็นเท็จ เผยแพร่บริการ หรือการกระทำใด ๆ ก็ตามที่ขัดต่อกฎหมาย และก่อให้เกิดความเสียหายแก่เรา
          หากข้อมูลส่วนบุคคล หรือข้อมูลที่เกี่ยวข้องของท่าน ไม่ว่าจะเป็นข้อมูลทั่วไป หรือข้อมูลส่วนบุคคลได้ถูกจารกรรมทางคอมพิวเตอร์จนสูญหายหรือเสียหาย ซึ่งมิใช่ความผิดของเรา เราขอสงวนสิทธิที่จะปฏิเสธความรับผิดชอบใด ๆ ที่เป็นผลมาจากการกระทำดังกล่าว
          ข้อ 8: ช่องทางการติดต่อเรา
          หากท่านต้องการทราบข้อมูลเพิ่มเติมเกี่ยวกับการยกเลิกบัญชี แจ้งเกี่ยวกับปัญหาการใช้งาน และความปลอดภัยของข้อมูลส่วนบุคคล ท่านสามารถ ติดต่อเราได้ที่
          DPIM Academy
          อีเมล : dpimacademy@gmail.com
          แฟนเพจ: https://www.facebook.com/DPIM-Academy-100270105368931 
          © 2021 DPIM Academy. All rights reserved.

        </Content>
        <ButtonWrapper>
          <Button type='primary' style={{ width: '100%' }} onClick={() => submit()}>ยอมรับ</Button>
        </ButtonWrapper>
      </Wrapper>
    </Modal>
  )
}

export default SpecialDayModal
